// #include <iostream>
// using namespace std;
// int main() {
// 	setlocale(LC_ALL, "rus");
// 	float t;//дробна весит меньше double
// 	cout << "Введите температуру на улице:"<<" ";
// 	cin >> t;
// 	if (t < 0) {
// 		cout << "Рекомендуется надеть зимнюю одежду";
// 	}
// 	else if (0 < t && t <= 10) {
// 		cout << "Рекомендуется надеть теплую одежду";
// 	}
// 	else if (11 <= t && t <= 20 ) {
// 		cout << "Рекомендуется надеть лёгкую одежду";
// 	}
// 	else if (t>20) {
// 		cout << "Рекомендуется надеть летнюю одежду";
// 	}
// 	return 0;
// }